In [46]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [47]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [48]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [49]:
target= df.Survived
inputs=df.drop('Survived',axis='columns')

# One hot encoding for Sex features

In [50]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [51]:
inputs= pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [52]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

# check the number of all columns to detect missing value

In [53]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

# to remove NaN

In [54]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [55]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [56]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [57]:
len(X_train)

712

In [58]:
len(X_test)

179

In [59]:
len(inputs)

891

In [60]:
X_train

     Pclass        Age     Fare  female  male
487       1  58.000000  29.7000       0     1
699       3  42.000000   7.6500       0     1
646       3  19.000000   7.8958       0     1
545       1  64.000000  26.0000       0     1
204       3  18.000000   8.0500       0     1
..      ...        ...      ...     ...   ...
140       3  29.699118  15.2458       1     0
212       3  22.000000   7.2500       0     1
447       1  34.000000  26.5500       0     1
489       3   9.000000  15.9000       0     1
274       3  29.699118   7.7500       1     0

[712 rows x 5 columns]

# now apply naive bayes model

In [61]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [62]:
model.fit(X_train,y_train)

GaussianNB()

In [63]:
model.score(X_test,y_test)

0.8212290502793296

In [64]:
X_test[:10]

     Pclass        Age     Fare  female  male
579       3  32.000000   7.9250       0     1
807       3  18.000000   7.7750       1     0
320       3  22.000000   7.2500       0     1
300       3  29.699118   7.7500       1     0
522       3  29.699118   7.2250       0     1
309       1  30.000000  56.9292       1     0
824       3   2.000000  39.6875       0     1
163       3  17.000000   8.6625       0     1
836       3  21.000000   8.6625       0     1
630       1  80.000000  30.0000       0     1

In [65]:
y_test[:10]

579    1
807    0
320    0
300    1
522    0
309    1
824    0
163    0
836    0
630    1
Name: Survived, dtype: int64

In [66]:
model.predict(X_test[:10])

array([0, 1, 0, 1, 0, 1, 0, 0, 0, 0], dtype=int64)

In [67]:
model.predict_proba(X_test[:10])

array([[0.9897166 , 0.0102834 ],
       [0.07134341, 0.92865659],
       [0.98754495, 0.01245505],
       [0.09174735, 0.90825265],
       [0.98934178, 0.01065822],
       [0.0054915 , 0.9945085 ],
       [0.96476167, 0.03523833],
       [0.98573304, 0.01426696],
       [0.98735038, 0.01264962],
       [0.78167743, 0.21832257]])